#include <stdio.h>
/*
 先判断是否为闰年，闰年是能被4整除但是不能被100整除或者是能被400整除
 一、三、五、七、八、十、腊(十二月)，是31天，
 剩下的除过二月份，都是30天
 */
int judge(int year, int month)
{
	if(month <= 2)
	{
		return 0;
	}
	else
	{
		return ( ((year % 4 == 0) && (year % 100 != 0)) || (year % 400 == 0) )?1:0;
	}
}
int main()
{
	int year,month,day;
	int days;
	int temp[] =
	{
		
		0                                   // 1月
		, 31                                // 2月
		, 31+28                             // 3月
		, 31+28+31                          // 4月
		, 31+28+31+30                       // 5月
		, 31+28+31+30+31                    // 6月
		, 31+28+31+30+31+30                 // 7月
		, 31+28+31+30+31+30+31              // 8月
		, 31+28+31+30+31+30+31+31           // 9月
		, 31+28+31+30+31+30+31+31+30        // 10月
		, 31+28+31+30+31+30+31+31+30+31     // 11月
		, 31+28+31+30+31+30+31+31+30+31+30  // 12月
	};
	while(scanf("%d/%d/%d",&year,&month,&day)!=EOF)
	{
		days = judge(year, month) + temp[month - 1] + day;
		printf("%d\n",days);
	}
	return 0;
}